---
kind: method
id: M:Autodesk.Revit.DB.Events.FailuresProcessingEventArgs.GetProcessingResult
source: html/25dc9e04-dc70-1093-035c-ed127700b532.htm
---
# Autodesk.Revit.DB.Events.FailuresProcessingEventArgs.GetProcessingResult Method

Retrieves current status of the failures processing result.

## Syntax (C#)
```csharp
public FailureProcessingResult GetProcessingResult()
```

## Returns
The current failures processing result.